**<b><center>PANDAS</center></b>**

&nbsp; &nbsp; &nbsp; &nbsp;Pandas, veri dosyaları üzerinde analizler yapmamızı sağlar.

<b>Pandas Serileri</b><br/>
&nbsp; &nbsp; &nbsp; &nbsp;Etiketli verilerden oluşan, tek boyutlu veri yapılarıdır. Etiket değerine <b>indeks</b> denir.<br/>Liste, sıralı diziler ya da sözlükler ile seri oluşturabiliriz.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;Seri oluşturmak için <b>pd.Series()</b> metodunu kullanırız.

In [3]:
import pandas as pd
#pd.Series(data, index, dtype, copy)
label_list = ['I','am','Learning','Data','Science']
data_List = [1,2,3,4,5]
pd_series = pd.Series(label_list,data_List)
print(pd_series)

1           I
2          am
3    Learning
4        Data
5     Science
dtype: object

&nbsp; &nbsp; &nbsp; &nbsp;Seriler arasında matematiksel işlemler yapabiliriz.

In [2]:
sinav1 = {'Michael ': 35, 'Olivia': 85}
v1 = pd.Series(sinav1)
sinav2 = {'Michael ': 44}
v2 = pd.Series(sinav2)
sinav3 = {"Luna": 99}
v3 = pd.Series(sinav3)

In [3]:
print(v1+v2)

Michael     79.0
Olivia       NaN
dtype: float64

&nbsp; &nbsp; &nbsp; &nbsp;<b>NaN</b> değerinin gelmesinin sebebi, Olivia'nın diğer seri içerisinde olmamasıdır. İşlem yapabilmemiz için verinin tüm serilerde bulunması gerekir.

In [7]:
v4 = pd.concat([v3,v1]) #Birleştirdik
print(v4)

Luna        99
Michael     35
Olivia      85
dtype: int64

Seriler içerisinde bulunan değerlere, listelerde olduğu gibi direkt erişebiliriz.

In [5]:
print(v4["Luna"])

99

*<i><b>DataFrame</b></i><br/>*
&nbsp; &nbsp; &nbsp; &nbsp;Pandas'ın çok boyutlu veri yapılarıdır. <br/>
&nbsp; &nbsp; &nbsp; &nbsp;Sütunlar <b>Column / Feature</b>, satırlar ise <b>Row / Indeks</b> olarak adlandırılırlar.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;Oluşturmak için <b>pd.DataFrame()</b> metodunu kullanırız.

In [6]:
from numpy.random import randn
df = pd.DataFrame(data = randn(4,4), 
            index = ['A','B','C','D'], 
            columns = ['Columns1','Columns2','Columns3','Columns4'])
df

   Columns1  Columns2  Columns3  Columns4
A -1.234957 -0.266394  0.429624  0.699209
B  0.480639 -0.084587 -0.906595  0.676379
C  0.337801 -0.994191  0.224610 -0.746010
D -0.538235 -1.965010  2.090792  0.705179

In [7]:
df[['Columns1',"Columns2"]]

   Columns1  Columns2
A -1.234957 -0.266394
B  0.480639 -0.084587
C  0.337801 -0.994191
D -0.538235 -1.965010

&nbsp; &nbsp; &nbsp; &nbsp;Yeni sütun eklemek istersek, direkt tanım yapabiliriz.

In [8]:
df["Columns5"] = pd.Series(randn(4), ['A','B','C','D'])
df

   Columns1  Columns2  Columns3  Columns4  Columns5
A -1.234957 -0.266394  0.429624  0.699209 -0.577381
B  0.480639 -0.084587 -0.906595  0.676379 -0.579672
C  0.337801 -0.994191  0.224610 -0.746010 -0.985170
D -0.538235 -1.965010  2.090792  0.705179  0.725850

&nbsp; &nbsp; &nbsp; &nbsp;Sütun ve satırlar arasında matematiksel işlemler yapabiliriz.

In [11]:
df["Columns6"] = df["Columns3"] / df["Columns1"]
df

   Columns1  Columns3  Columns4  Columns5  Columns6
A -1.234957  0.429624  0.699209 -0.577381 -0.347886
B  0.480639 -0.906595  0.676379 -0.579672 -1.886229
C  0.337801  0.224610 -0.746010 -0.985170  0.664919
D -0.538235  2.090792  0.705179  0.725850 -3.884535

&nbsp; &nbsp; &nbsp; &nbsp;Ekli sütunları çıkartmak için default değeri <b>0</b> olan <b>axis</b> parametresini kullanırız.<b>0</b> satır, <b>1</b> ise sütunları simgeler.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;DataFrame üzerinde yaptığımız işlemlerin kalıcı olmasını istiyorsak <b>inplace</b> parametresini <b>True</b> yapmalıyız.

In [9]:
df.drop('Columns2', axis = 1, inplace = True)
df

   Columns1  Columns3  Columns4  Columns5
A -1.234957  0.429624  0.699209 -0.577381
B  0.480639 -0.906595  0.676379 -0.579672
C  0.337801  0.224610 -0.746010 -0.985170
D -0.538235  2.090792  0.705179  0.725850

&nbsp; &nbsp; &nbsp; &nbsp;Seçtiğimiz bir sütunu <b>index</b> başlığı olarak atayabiliriz.

In [12]:
df.set_index("Columns6", inplace=True)
df

           Columns1  Columns3  Columns4  Columns5
Columns6
-0.347886 -1.234957  0.429624  0.699209 -0.577381
-1.886229  0.480639 -0.906595  0.676379 -0.579672
 0.664919  0.337801  0.224610 -0.746010 -0.985170
-3.884535 -0.538235  2.090792  0.705179  0.725850

&nbsp; &nbsp; &nbsp; &nbsp;Satır ve sütun isimlerine erişmek için <b>.names</b> metodunu kullanırız

In [13]:
df.index.names

FrozenList(['Columns6'])

In [14]:
df.columns.names

FrozenList([None])

&nbsp; &nbsp; &nbsp; &nbsp;<b>iloc</b> fonksiyonu satırın index değerine, <b>loc</b> ise indeks adına göre sütun değerlerini döndürür.

In [15]:
df = pd.DataFrame(data = randn(4,4), 
            index = ['A','B','C','D'], 
            columns = ['Columns1','Columns2','Columns3','Columns4'])
df

   Columns1  Columns2  Columns3  Columns4
A -0.568221  0.430966 -1.460638 -1.229908
B  0.078514 -0.424473  0.238341 -2.051763
C -0.419836 -1.005222  2.304167  0.903924
D  0.142613  0.247134 -0.317689  1.780903

In [16]:
df.loc['A']

Columns1   -0.568221
Columns2    0.430966
Columns3   -1.460638
Columns4   -1.229908
Name: A, dtype: float64

In [17]:
df.iloc[0]

Columns1   -0.568221
Columns2    0.430966
Columns3   -1.460638
Columns4   -1.229908
Name: A, dtype: float64

In [18]:
df.loc['A','Columns2']

0.43096642964542553

In [19]:
df.loc[['A','D'],['Columns4','Columns2']]

   Columns4  Columns2
A -1.229908  0.430966
D  1.780903  0.247134

*<b><i>DataFrame Üzerinde Filtreleme İşlemleri</i></b>*

In [20]:
df

   Columns1  Columns2  Columns3  Columns4
A -0.568221  0.430966 -1.460638 -1.229908
B  0.078514 -0.424473  0.238341 -2.051763
C -0.419836 -1.005222  2.304167  0.903924
D  0.142613  0.247134 -0.317689  1.780903

&nbsp; &nbsp; &nbsp; &nbsp;Bütün verileri tek koşul üzerinden kontrol edebiliriz. Örneğin 1'den büyük olan değerler, <b>True</b> olurken, küçük olanlar ise <b>False</b> değerini almıştır.

In [21]:
df > 1

   Columns1  Columns2  Columns3  Columns4
A     False     False     False     False
B     False     False     False     False
C     False     False      True     False
D     False     False     False      True

&nbsp; &nbsp; &nbsp; &nbsp;Şartı sağlayan verileri görmek istersek,

In [22]:
df[df>0]

   Columns1  Columns2  Columns3  Columns4
A       NaN  0.430966       NaN       NaN
B  0.078514       NaN  0.238341       NaN
C       NaN       NaN  2.304167  0.903924
D  0.142613  0.247134       NaN  1.780903

&nbsp; &nbsp; &nbsp; &nbsp;Koşulu sağlayan değerleri yoksa, görmek istediğimiz veriler boş dönecektir.</br>
&nbsp; &nbsp; &nbsp; &nbsp;Sadece bir ya da bir kaç sütunun koşulu sağlayıp, sağlamadığını kontrol edelim.

In [23]:
df['Columns1'] > 0

A    False
B     True
C    False
D     True
Name: Columns1, dtype: bool

In [24]:
df[df['Columns4']> 0]

   Columns1  Columns2  Columns3  Columns4
C -0.419836 -1.005222  2.304167  0.903924
D  0.142613  0.247134 -0.317689  1.780903

&nbsp; &nbsp; &nbsp; &nbsp;Koşul ve şart işaretlerini de kullanabiliriz.</br>
&nbsp; &nbsp; &nbsp; &nbsp;<b>&</b> işareti <b> and</b>  anlamında ve <b>|</b> işareti <b>or</b>  anlamındadır.

In [25]:
df[(df['Columns1']> 0) & (df['Columns3']> 0)]

   Columns1  Columns2  Columns3  Columns4
B  0.078514 -0.424473  0.238341 -2.051763

<br>
<br>

*<i><b>DataFrame' lerin Multi Index Olarak Tanımlanması</b></i>*

&nbsp; &nbsp; &nbsp; &nbsp;Index değerinin çok olduğu durumlarda, gruplama yapmak için kullanılır.</br>
&nbsp; &nbsp; &nbsp; &nbsp;İlk olarak iki adet indeks tanımlayacağız, ardından <b>zip</b> fonksiyonu ile birleştireceğiz.</br>Bunu yaparken <b>Tuple</b> ve <b>Dict</b> veri türlerini de kullanabiliriz.

In [26]:
OuterIndex = ['Group1','Group1','Group1',
              'Group2','Group2','Group2',
              'Group3','Group3','Group3']
InnerIndex = ['Index1','Index2','Index3',
              'Index1','Index2','Index3',
              'Index1','Index2','Index3']
list(zip(OuterIndex,InnerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

&nbsp; &nbsp; &nbsp; &nbsp;Birleştirdiğimiz indeks tanımlarını, <b>pd.MultiIndex.from_tuples</b> metodu yardımıyla Multi Indeks olarak tanımladık.

In [27]:
hierarchy = list(zip(OuterIndex,InnerIndex))
hierarchy = pd.MultiIndex.from_tuples(hierarchy)
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

&nbsp; &nbsp; &nbsp; &nbsp;Şimdi rastgele değerler oluşturalım.

In [28]:
df = pd.DataFrame(randn(9,3),hierarchy,columns = ['Column1','Colum2','Column3'])
df

                Column1    Colum2   Column3
Group1 Index1 -0.376460  1.555650 -0.529534
       Index2  1.118490 -2.627686 -2.525702
       Index3  1.370861  0.408032  0.557412
Group2 Index1  0.091995  0.497143  0.871308
       Index2  0.009221  0.067685  1.876448
       Index3 -0.720830 -0.053261  0.077901
Group3 Index1  0.332184 -1.551962  0.060127
       Index2  0.504010 -1.512259 -0.446424
       Index3 -0.061763 -0.442169  0.819662

&nbsp; &nbsp; &nbsp; &nbsp;Ulaşmak istediğimiz verilere, grup, indeks, sütun bilgileri üzerinden erişebiliriz.

In [29]:
df['Column1']

Group1  Index1   -0.376460
        Index2    1.118490
        Index3    1.370861
Group2  Index1    0.091995
        Index2    0.009221
        Index3   -0.720830
Group3  Index1    0.332184
        Index2    0.504010
        Index3   -0.061763
Name: Column1, dtype: float64

In [30]:
df.loc[['Group1','Group2']]

                Column1    Colum2   Column3
Group1 Index1 -0.376460  1.555650 -0.529534
       Index2  1.118490 -2.627686 -2.525702
       Index3  1.370861  0.408032  0.557412
Group2 Index1  0.091995  0.497143  0.871308
       Index2  0.009221  0.067685  1.876448
       Index3 -0.720830 -0.053261  0.077901

In [31]:
df.loc['Group1'].loc['Index1']['Column1']

-0.37646045455297744

&nbsp; &nbsp; &nbsp; &nbsp;<b>.xs()</b> fonksiyonu <b>loc ve iloc</b> fonksiyonlarının işlevlerini yerine getirir. Fonksiyon, grup indeks sırası ile çalışır.

In [32]:
df.xs('Group1') # df.xs('Group1') = df.loc['Group1']

         Column1    Colum2   Column3
Index1 -0.376460  1.555650 -0.529534
Index2  1.118490 -2.627686 -2.525702
Index3  1.370861  0.408032  0.557412

&nbsp; &nbsp; &nbsp; &nbsp;Indeks bilgilerine isim atamak istersek <b>.index.names</b> fonksiyonu kullanılır.

In [33]:
df.index.names = ['Groups','Indexes']
df

                 Column1    Colum2   Column3
Groups Indexes
Group1 Index1  -0.376460  1.555650 -0.529534
       Index2   1.118490 -2.627686 -2.525702
       Index3   1.370861  0.408032  0.557412
Group2 Index1   0.091995  0.497143  0.871308
       Index2   0.009221  0.067685  1.876448
       Index3  -0.720830 -0.053261  0.077901
Group3 Index1   0.332184 -1.551962  0.060127
       Index2   0.504010 -1.512259 -0.446424
       Index3  -0.061763 -0.442169  0.819662

&nbsp; &nbsp; &nbsp; &nbsp;Seçeceğimiz indeksin grup bilgilerini getirelim.

In [34]:
df.xs('Index1', level = 'Indexes')

         Column1    Colum2   Column3
Groups
Group1 -0.376460  1.555650 -0.529534
Group2  0.091995  0.497143  0.871308
Group3  0.332184 -1.551962  0.060127

In [35]:
df.xs('Index1', level = 'Indexes')['Column1']

Groups
Group1   -0.376460
Group2    0.091995
Group3    0.332184
Name: Column1, dtype: float64

<br>
<br>
<br>

*<i><b>Bozuk ve Kayıp Verilerle Uğraşmak</b></i>*

&nbsp; &nbsp; &nbsp; &nbsp;Yeni bir veri oluşturup, DataFrame'e çevirelim.

In [36]:
import numpy as np
arr = np.array([[10,20,np.nan],[3,np.nan,np.nan],[13,np.nan,4]])
arr

array([[10., 20., nan],
       [ 3., nan, nan],
       [13., nan,  4.]])

In [38]:
df = pd.DataFrame(arr, index = ['Index1','Index2','Index3'],
                columns = ['Column1','Column2','Column3'] )
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      3.0      NaN      NaN
Index3     13.0      NaN      4.0

&nbsp; &nbsp; &nbsp; &nbsp;Bozuk veriler <b>NaN</b> olarak gözükmektedir. Amacımız bunlardan kurtulmak.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;Bunu bazen ilgili yerleri silerek, daha fazla veri toplayarak ya da farklı hesaplamalar ile yerlerini doldurarak yaparız.

&nbsp; &nbsp; &nbsp; &nbsp;<b>.dropna()</b> metodu indeks satırında en az bir adet <b>Nan</b> değer varsa, o satırı siler.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;<b>axis</b> değerini 1 yaparsak, aynı işlemi sütun için uygular. <b>inplace</b> değerini True yapmadığımız için değişiklikler yansımayacak.

In [39]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [40]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2      3.0
Index3     13.0

&nbsp; &nbsp; &nbsp; &nbsp;<b>thresh</b> belirleyeceğimiz adete kadar karşılık gelen düzgün veri varsa, silme işlemini yapma demektir.

In [41]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     13.0      NaN      4.0

&nbsp; &nbsp; &nbsp; &nbsp;<b>fillna</b> belirleyeceğimiz değer, <b>NaN</b> olan değerler ile değiştirir.

In [42]:
df.fillna(value = 0)

        Column1  Column2  Column3
Index1     10.0     20.0      0.0
Index2      3.0      0.0      0.0
Index3     13.0      0.0      4.0

&nbsp; &nbsp; &nbsp; &nbsp;Sütunlarda bulunan verilerin toplamı

In [43]:
df.sum()

Column1    26.0
Column2    20.0
Column3     4.0
dtype: float64

&nbsp; &nbsp; &nbsp; &nbsp; Verilerin toplamı

In [44]:
df.sum().sum()

50.0

In [45]:
df.fillna(value = (df.sum().sum())/ 5)

        Column1  Column2  Column3
Index1     10.0     20.0     10.0
Index2      3.0     10.0     10.0
Index3     13.0     10.0      4.0

&nbsp; &nbsp; &nbsp; &nbsp;<b>.size</b> toplam veri adetini döndürür.

In [48]:
df.size

9

&nbsp; &nbsp; &nbsp; &nbsp;<b>.isnull()</b>, veri içerisindeki <b>NaN</b> değerleri True olarak gösterir.

In [ ]:
df.isnull()

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False

&nbsp; &nbsp; &nbsp; &nbsp;<b>NaN</b> değerlerinin toplam adetini görmek istersek.

In [ ]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

&nbsp; &nbsp; &nbsp; &nbsp;<b>NaN</b> olmayan veri adeti içinse,

In [ ]:
df.size - df.isnull().sum()

Column1    9
Column2    7
Column3    7
dtype: int64

*<b><i>GroupBy Operasyonları</i></b>*

&nbsp; &nbsp; &nbsp; &nbsp;Verileri istediğimiz şekilde gruplamamızı sağlar.

In [1]:
data = {'Job': ['Data Mining','CEO','Lawyer','Lawyer','Data Mining','CEO'],
        'Labouring': ['Immanuel','Jeff','Olivia','Maria','Walker','Obi-Wan'], 
        'Salary': [4500,30000,6000,5250,5000,35000]}

In [4]:
df = pd.DataFrame(data)
df

           Job Labouring  Salary
0  Data Mining  Immanuel    4500
1          CEO      Jeff   30000
2       Lawyer    Olivia    6000
3       Lawyer     Maria    5250
4  Data Mining    Walker    5000
5          CEO   Obi-Wan   35000

&nbsp; &nbsp; &nbsp; &nbsp;<b>.groupby()</b> yardımıyla Salary türüne göre gruplama yaparak, toplam bilgisini alalım.

In [51]:
SalaryGroupBy = df.groupby('Salary')
SalaryGroupBy

In [52]:
SalaryGroupBy.sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [53]:
SalaryGroupBy.min()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

&nbsp; &nbsp; &nbsp; &nbsp;Job türüne göre gruplama yapalım.

In [55]:
df.groupby('Job').min()

            Labouring  Salary
Job
CEO              Jeff   30000
Data Mining  Immanuel    4500
Lawyer          Maria    5250

In [54]:
SalaryGroupBy.max()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [56]:
df.groupby('Salary').sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [6]:
df.groupby('Job').sum(numeric_only=False).loc['CEO']

Labouring    JeffObi-Wan
Salary             65000
Name: CEO, dtype: object

In [58]:
df.groupby('Job').count()

             Labouring  Salary
Job
CEO                  2       2
Data Mining          2       2
Lawyer               2       2

In [59]:
df.groupby('Job').min()['Salary']

Job
CEO            30000
Data Mining     4500
Lawyer          5250
Name: Salary, dtype: int64

In [60]:
df.groupby('Job').min()['Salary']['Lawyer']

5250

*<i><b>Concatenate, Merge Ve Join Fonksiyonları</b></i>*

&nbsp; &nbsp; &nbsp; &nbsp;<b>Concatenate</b>, birleştirme işlemini bu fonksiyon ile yapmaktayız. Özellik olarak <b>zip</b> fonksiyonuna benzemektedir.

In [62]:
data = {'A': ['A1','A2','A3','A4'],
        'B': ['B1','B2','B3','B4'],
        'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],
        'B': ['B5','B6','B7','B8'],
        'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [63]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

&nbsp; &nbsp; &nbsp; &nbsp;<b>.concat</b> ile birleştirme işlemini yapalım.

In [64]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

&nbsp; &nbsp; &nbsp; &nbsp;<b>axis</b> parametresini 1 yaparak, sütun birleştirmesi yapabiliriz.<br/>
&nbsp; &nbsp; &nbsp; &nbsp;Birleştirmeden dolayı karşılığı olmayan değerler <b>NaN</b> gelecektir.

In [65]:
pd.concat([df1,df2], axis = 1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

&nbsp; &nbsp; &nbsp; &nbsp;<b>Join</b> yalnızca diğer veri kümesinde eşleşmesi olan nesnelerin döndürüldüğü bir birleşim türü olan iç birleşim uygular.

In [66]:
data = {'A': ['A1','A2','A3','A4'],
        'B': ['B1','B2','B3','B4'],
        'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],
        'B': ['B5','B6','B7','B8'],
        'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [67]:
data2 = { 'id': ['1', '2', '6', '7', '8'], 
        'Feature1': ['K', 'M', 'O', 'Q', 'S'], 
        'Feature2': ['L', 'N', 'P', 'R', 'T']}
df2 = pd.DataFrame(data2, columns = ['id', 'Feature1', 'Feature2'])
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T

In [68]:
df1.join(df2)

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

In [69]:
df2.join(df1)

  id Feature1 Feature2    A    B    C
0  1        K        L  NaN  NaN  NaN
1  2        M        N   A1   B1   C1
2  6        O        P   A2   B2   C2
3  7        Q        R   A3   B3   C3
4  8        S        T   A4   B4   C4

&nbsp; &nbsp; &nbsp; &nbsp;<b>how</b> parametresini değiştirerek, <b>Left Join</b>, <b>Right Join</b>,<b>Inner</b> ve <b>Outer</b>  işlemlerini uygularız.

<p style="text-align:center;"><img class="invert-on-dark" alt="SQL LEFT JOIN" src="https://www.w3schools.com/sql/img_leftjoin.gif" width="200" height="145"></p>

In [70]:
df1.join(df2, how = 'left')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

<p style="text-align:center;"><img class="invert-on-dark" alt="SQL RIGHT JOIN" src="https://www.w3schools.com/sql/img_rightjoin.gif" width="200" height="145"></p>

In [71]:
df1.join(df2, how = 'right')

     A    B    C id Feature1 Feature2
0  NaN  NaN  NaN  1        K        L
1   A1   B1   C1  2        M        N
2   A2   B2   C2  6        O        P
3   A3   B3   C3  7        Q        R
4   A4   B4   C4  8        S        T

<p style="text-align:center;"><img class="invert-on-dark" alt="SQL FULL OUTER JOIN" src="https://www.w3schools.com/sql/img_fulljoin.gif" width="200" height="145"></p>

In [72]:
df1.join(df2, how ='outer')

     A    B    C id Feature1 Feature2
0  NaN  NaN  NaN  1        K        L
1   A1   B1   C1  2        M        N
2   A2   B2   C2  6        O        P
3   A3   B3   C3  7        Q        R
4   A4   B4   C4  8        S        T

<p style="text-align:center;"><img class="invert-on-dark" alt="SQL INNER JOIN" src="https://www.w3schools.com/sql/img_innerjoin.gif" width="200" height="145"></p>

In [73]:
df1.join(df2, how = 'inner')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

In [74]:
df1.join(df2, sort = 'True')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

&nbsp; &nbsp; &nbsp; &nbsp;Hepsini birleştirelim.

In [75]:
frames = [df1,df2]
df_keys = pd.concat(frames, keys=['x', 'y'])
df_keys

       A    B    C   id Feature1 Feature2
x 1   A1   B1   C1  NaN      NaN      NaN
  2   A2   B2   C2  NaN      NaN      NaN
  3   A3   B3   C3  NaN      NaN      NaN
  4   A4   B4   C4  NaN      NaN      NaN
y 0  NaN  NaN  NaN    1        K        L
  1  NaN  NaN  NaN    2        M        N
  2  NaN  NaN  NaN    6        O        P
  3  NaN  NaN  NaN    7        Q        R
  4  NaN  NaN  NaN    8        S        T

*<i><b>DataFrame Operasyonları</b></i>*

In [12]:
data = {'Column1': [1,2,3,4,5,6], 
        'Column2': [1000,1000,2000,3000,3000,1000],
        'Column3': ['Mace Windu','Darth Vader',
                    'Palpatine','Kylo Ren','Rey','Obi-Wan']}
df = pd.DataFrame(data)
df

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

&nbsp; &nbsp; &nbsp; &nbsp;<b>.head()</b>, ilk beş değeri gösterir.Parametre alırsa o kadarını listeler.

In [77]:
df.head()

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey

In [78]:
df.head(n = 2)

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader

&nbsp; &nbsp; &nbsp; &nbsp;<b>.info</b> veri seti hakkında bilgi verir.

In [79]:
df.info

<bound method DataFrame.info of    Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan>

&nbsp; &nbsp; &nbsp; &nbsp;<b>.describe()</b> istatistik bilgiler verir. <b>.corr()</b> korelasyon bilgiside bunlardan biridir.

In [81]:
df.describe()

        Column1      Column2
count  6.000000     6.000000
mean   3.500000  1833.333333
std    1.870829   983.192080
min    1.000000  1000.000000
25%    2.250000  1000.000000
50%    3.500000  1500.000000
75%    4.750000  2750.000000
max    6.000000  3000.000000

In [13]:
df

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

&nbsp; &nbsp; &nbsp; &nbsp;<b>.unique()</b> birbirinden farklı kategorilerin bilgisini verir.

In [14]:
df['Column1'].unique()

array([1, 2, 3, 4, 5, 6], dtype=int64)

&nbsp; &nbsp; &nbsp; &nbsp;<b>.nunique()</b>, kaç adet eşsiz, tekrar etmeyen verinin olduğu bilgisini döndürür.

In [15]:
df['Column1'].nunique()

6

&nbsp; &nbsp; &nbsp; &nbsp;<b>.value_counts()</b> hangi değerden kaç adet olduğunu veren fonksiyondur.

In [85]:
df['Column2'].value_counts()

1000    3
3000    2
2000    1
Name: Column2, dtype: int64

&nbsp; &nbsp; &nbsp; &nbsp;Tanımlayacağımız işlemleri uygulayabiliriz.

In [89]:
df['Column2'].apply(lambda x : x **2 )

0    1000000
1    1000000
2    4000000
3    9000000
4    9000000
5    1000000
Name: Column2, dtype: int64

&nbsp; &nbsp; &nbsp; &nbsp;<b>.sort_values()</b> belli bir değere göre sıralamamızı sağlar. <b>ascending</b> parametresi <b>False</b> olursa büyükten küçüğe sıralama yapar.

In [90]:
df.sort_values(by=['Column1', 'Column2'])

   Column1  Column2      Column3
0        1     1000   Mace Windu
1        2     1000  Darth Vader
2        3     2000    Palpatine
3        4     3000     Kylo Ren
4        5     3000          Rey
5        6     1000      Obi-Wan

In [16]:
df.sort_values('Column2', ascending = False)

   Column1  Column2      Column3
3        4     3000     Kylo Ren
4        5     3000          Rey
2        3     2000    Palpatine
0        1     1000   Mace Windu
1        2     1000  Darth Vader
5        6     1000      Obi-Wan

*<b><i>Pivot Table</i></b>*

In [92]:
df = pd.DataFrame({'Month': ['January','February',
                    'March','January','February',
                    'March','January','February',
                    'March'],
                'State':['New York','New York',
                    'New York','Texas','Texas',
                    'Texas','Washington','Washington',
                    'Washington'],
'moisture': [20,25,65,34,56,85,21,56,79]})
df

      Month       State  moisture
0   January    New York        20
1  February    New York        25
2     March    New York        65
3   January       Texas        34
4  February       Texas        56
5     March       Texas        85
6   January  Washington        21
7  February  Washington        56
8     March  Washington        79

In [19]:
df.corr(numeric_only=True)

          Column1   Column2
Column1  1.000000  0.380562
Column2  0.380562  1.000000

In [94]:
df.pivot_table(index = 'Month', columns = 'State', values = 'moisture')

State     New York  Texas  Washington
Month
February        25     56          56
January         20     34          21
March           65     85          79

*<i><b>Veri Setini Okuma Yöntemleri</b></i>*

&nbsp; &nbsp; &nbsp; &nbsp;<b>pd.read_csv()</b> .csv uzantılı dosyayı okur.

In [ ]:
dataset = pd.read_csv('Dosya_Yolu\Data_Name.csv')

&nbsp; &nbsp; &nbsp; &nbsp;<b>.to_csv()</b> Datayı tekrardan csv'ye dönüştürebilmek için

In [ ]:
dataset.to_csv('Data_Name')

&nbsp; &nbsp; &nbsp; &nbsp;<b>pd.read_excel()</b> Excel Dosyasını okumak için

In [ ]:
excelset = pd.read_excel('Excels_Name.xlsx')

&nbsp; &nbsp; &nbsp; &nbsp;<b>.to_excel()</b>  Excel dosyasına çevirme

In [ ]:
excelset.to_excel('excelnewfile.xlsx')

&nbsp; &nbsp; &nbsp; &nbsp;<b>pd.read_html()</b> internette ki bir veriyi okumak için

In [ ]:
new = pd.read_html(' Datasetin urlsi.html')

<b>İletişim</b> <br/>
<a href="mailto:berkayyurur@gmail.com">
    <img src="https://camo.githubusercontent.com/c44086cddf7f39a51f77e8a27e5a23dbfc7ed0722f55d49ad0afadad4d1e0471/68747470733a2f2f75706c6f61642e77696b696d656469612e6f72672f77696b6970656469612f636f6d6d6f6e732f342f34652f476d61696c5f49636f6e2e706e67" alt="berkayyurur@gmail.com" data-canonical-src="https://upload.wikimedia.org/wikipedia/commons/4/4e/Gmail_Icon.png" style="max-width: 100%;" width="30" height="30">
</a>
<a href="https://www.linkedin.com/in/berkayyurur/" rel="nofollow">
    <img src="https://camo.githubusercontent.com/941103b55ebacbfa446f1ade5f01f1419a12a2c6133fb07ef8894a524566498a/68747470733a2f2f636f6e74656e742e6c696e6b6564696e2e636f6d2f636f6e74656e742f64616d2f6d652f627573696e6573732f656e2d75732f616d702f6272616e642d736974652f76322f62672f4c492d4275672e7376672e6f726967696e616c2e737667" alt="berkayyurur" data-canonical-src="https://content.linkedin.com/content/dam/me/business/en-us/amp/brand-site/v2/bg/LI-Bug.svg.original.svg" style="max-width: 100%;" width="30" height="30">
  </a>

<b>Referans</b> <br/>
<ul>
  <li><a href="https://medium.com/deep-learning-turkiye/adan-z-ye-pandas-tutoriali-ba%C5%9Flang%C4%B1%C3%A7-ve-orta-seviye-4edf0094e0d5">Pandas Tutorial</a></li>
  <li><a href="www.w3schools.com">w3schools</a></li>
</ul>